src/InformationRegisters/СтатистикаБуфер/СтатистикаБуфер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаБуфер</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатистикаБуфер/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ДобавитьДанные(Данные) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СтатистикаБуфер.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДатаЗаписи = НачалоМинуты(ТекущаяДата());
	МенеджерЗаписи.ГУИД = Новый УникальныйИдентификатор();
    МенеджерЗаписи.Данные = Данные;
	
	МенеджерЗаписи.Записать(Ложь);
	
КонецПроцедуры

Функция СтрокаВКодировкуСервиса(Текст) Экспорт
    
    Результат = СтрЗаменить(Текст, "/", "↔");
	Результат = СтрЗаменить(Текст, ".", "♂");
    
    Возврат Результат;
    
КонецФункции

#КонецЕсли
